# install common CLIs
# see: https://rick.cogley.info/post/use-homebrew-zsh-instead-of-the-osx-default/
brew "zsh"
brew "git"
brew "direnv"
brew "dos2unix"
brew "jq"

# install Python development tools
brew "python3"
brew "pyenv"
brew "pyenv-virtualenv"


# install NodeJS development tools
brew "node"
brew "npm"
brew "nvm"

# install PHP development tools
brew "php"
brew "composer"

# install Ruby development tools
brew "ruby"

# install common cloud/deployment tools
brew "awscli"
brew "packer"
brew "terraform"
brew "kubernetes-cli"
brew "kubernetes-helm"

# install GUIs
cask "spectacle"
cask "google-cloud-sdk"
#cask "google-chrome"
#cask "intellij-idea"
#cask "postman"
#cask "docker"
#cask "slack"
