# install common CLIs
# see: https://rick.cogley.info/post/use-homebrew-zsh-instead-of-the-osx-default/
brew "zsh"
brew "git"
brew "direnv"           # alternative: asdf-direnv
brew "dos2unix"
brew "jq"               # alternative: asdf-jq
brew "unzip"
brew "coreutils"
brew "gpg"
brew "bison"

# install asdf
brew "asdf"

# install common cloud/deployment tools
brew "awscli"
brew "packer"           # alternative: asdf-packer
brew "terraform"        # alternative: asdf-terraform
brew "kubectl"          # alternative: asdf-kubectl
brew "helm"             # alternative: asdf-helm

# install GUIs
#cask "spectacle"
#cask "google-chrome"
#cask "intellij-idea"
#cask "postman"
#cask "docker"
#cask "slack"
